In [17]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import preprocessing
from sklearn.preprocessing import StandardScaler
from sklearn.decomposition import PCA
from sklearn.cluster import KMeans
from sklearn.manifold import TSNE
import plotly.graph_objs as go
import plotly .offline as offline
import plotly.figure_factory as ff

In [18]:
# Importing dataset through Pandas
df = pd.read_csv("../datasets/Clients.csv")
df.head()

,age,job,marital,education,default,balance,housing,personal,term
0,58,management,married,tertiary,no,2143,yes,no,no
1,44,technician,single,secondary,no,29,yes,no,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,no
3,35,management,married,tertiary,no,231,yes,no,no
4,28,management,single,tertiary,no,447,yes,yes,no

In [19]:
# Shape of the dataset
print(df.shape)

(43193, 9)

In [20]:
# info of dataset
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43193 entries, 0 to 43192
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        43193 non-null  int64
 1   job        43193 non-null  object
 2   marital    43193 non-null  object
 3   education  43193 non-null  object
 4   default    43193 non-null  object
 5   balance    43193 non-null  int64
 6   housing    43193 non-null  object
 7   personal   43193 non-null  object
 8   term       43193 non-null  object
dtypes: int64(2), object(7)
memory usage: 3.0+ MB
None

In [21]:
# Description of dataset
print(df.describe())

                age        balance
count  43193.000000   43193.000000
mean      40.764082    1354.027342
std       10.512640    3042.103625
min       18.000000   -8019.000000
25%       33.000000      71.000000
50%       39.000000     442.000000
75%       48.000000    1412.000000
max       95.000000  102127.000000

In [23]:
# Converting Categorical features into Numerical features

for column in df.columns:
    if df[column].dtype == 'object':
        lbl = preprocessing.LabelEncoder()
        lbl.fit(list(df[column].values)) 
        df[column] = lbl.transform(list(df[column].values))

In [16]:
df.head()

   age  job  marital  education  default  balance  housing  personal  term
0   58    4        1          2        0     2143        1         0     0
1   44    9        2          1        0       29        1         0     0
2   33    2        1          1        0        2        1         1     0
3   35    4        1          2        0      231        1         0     0
4   28    4        2          2        0      447        1         1     0

In [27]:
# Plotting Correlation Heatmap
corrs = df.corr()
figure = ff.create_annotated_heatmap(
    z=corrs.values,
    x=list(corrs.columns),
    y=list(corrs.index),
    annotation_text=corrs.round(2).values,
    showscale=True)
offline.plot(figure,filename='corrheatmap.html')

'corrheatmap.html'